docs: added architecture and security
